# Reference Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Reference Constructor
Reference Class See Also
---
Creates a Reference with the supplied element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Reference(
	Element element
)
```

Visual Basic
---
```text
Public Sub New ( _
	element As Element _
)
```

Visual C++
---
```text
public:
Reference(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..ElementThe element to create a reference.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the parameter is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
Reference Class
Autodesk.Revit.DB Namespace